Revit 2027 API
CustomExporter.ShouldStopOnError Property
 This flag instructs the exporting process to either stop or continue in case an error occurs during any of the exporting methods.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShouldStopOnError { get; set; }
Public Property ShouldStopOnError As Boolean
	Get
	Set
public:
property bool ShouldStopOnError {
	bool get ();
	void set (bool value);
}
member ShouldStopOnError : bool with get, set
Property Value
Boolean
See Also
Reference
CustomExporter Class
Autodesk.Revit.DB Namespace